app/views/todo_lists/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= f.label :category %><br>
    <%= f.collection_select :category_id, Category.all, :id, :name, {prompt: "Choose a Category"} %>