app/controllers/todo_lists_controller.rb

  def create
    @todo_list = current_user.todo_lists.build(todo_list_params)

    respond_to do |format|
      if @todo_list.save
---
INSERT INTO "todo_lists" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-07-24 16:50:14.728526"], ["description", "Stuff to build a todo list!"], ["title", "12 in 12 Week 6"], ["updated_at", "2015-07-24 16:50:14.728526"]]

  def update
    respond_to do |format|
      if @todo_list.update(todo_list_params)
---
UPDATE "todo_lists" SET "category_id" = ?, "updated_at" = ? WHERE "todo_lists"."id" = 5  [["category_id", 1], ["updated_at", "2015-08-06 14:37:58.644019"]]