app/controllers/todo_items_controller.rb

  def create
    @todo_item = @todo_list.todo_items.create(todo_item_params)
---
INSERT INTO "todo_items" ("content", "created_at", "todo_list_id", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Make the dam app!"], ["created_at", "2015-07-24 17:08:30.289236"], ["todo_list_id", 1], ["updated_at", "2015-07-24 17:08:30.289236"]]